v1 = [0] * 20
v2 = [0] * 20
v3 = ["0"] * 20
v4 = [0] * 20

######################################################################################################################################

for x in range(len(v1)):
    v1[x] = int(input("Informe um valor inteiro: "))
    v2[x] = int(input("Informe outro valor inteiro: "))
    v3[x] = input("Agora informe uma das quatro operações aritiméticas básicas: ")
    
######################################################################################################################################
    
for x in range(len(v1)):
    if v3[x] == '+':
        v4[x] = v1[x] + v2[x]
    elif v3[x] == '-':
        v4[x] = v1[x] - v2[x]
    elif v3[x] == '*':
        v4[x] = v1[x] * v2[x]
    elif v3[x] == '/':
        if v2[x] == 0:
            print(f"{v1[v]}/{v2[x]}Impossivel dividir por zero\n")
        else:    
            v4[x] = v1[x] / v2[x]
            
#######################################################################################################################################
print(v4)
